package dajareGo

import (
	"strings"
)

func katakana2Romaji(s Syllable) Syllable {
	syllables := [...]rep{
		// 清音
		{"ア", ".a"},
		{"イ", ".i"},
		{"ウ", ".u"},
		{"エ", ".e"},
		{"オ", ".o"},

		{"カ", "ka"},
		{"キ", "ki"},
		{"ク", "ku"},
		{"ケ", "ke"},
		{"コ", "ko"},

		{"サ", "sa"},
		{"シ", "si"},
		{"ス", "su"},
		{"セ", "se"},
		{"ソ", "so"},

		{"タ", "ta"},
		{"チ", "ti"},
		{"ツ", "tu"},
		{"テ", "te"},
		{"ト", "to"},

		{"ナ", "na"},
		{"ニ", "ni"},
		{"ヌ", "nu"},
		{"ネ", "ne"},
		{"ノ", "no"},

		{"ハ", "ha"},
		{"ヒ", "hi"},
		{"フ", "hu"},
		{"ヘ", "he"},
		{"ホ", "ho"},

		{"マ", "ma"},
		{"ミ", "mi"},
		{"ム", "mu"},
		{"メ", "me"},
		{"モ", "mo"},

		{"ヤ", "ya"},
		{"ユ", "yu"},
		{"ヨ", "yo"},

		{"ラ", "ra"},
		{"リ", "ri"},
		{"ル", "ru"},
		{"レ", "re"},
		{"ロ", "ro"},

		{"ワ", "wa"},
		{"ヰ", "wi"},
		{"ヱ", "we"},
		{"ヲ", "wo"},

		// 濁音・半濁音
		{"ヴ", "vu"},

		{"ガ", "ga"},
		{"ギ", "gi"},
		{"グ", "gu"},
		{"ゲ", "ge"},
		{"ゴ", "go"},

		{"ザ", "za"},
		{"ジ", "zi"},
		{"ズ", "zu"},
		{"ゼ", "ze"},
		{"ゾ", "zo"},

		{"ダ", "da"},
		{"ヂ", "di"},
		{"ヅ", "du"},
		{"デ", "de"},
		{"ド", "do"},

		{"バ", "ba"},
		{"ビ", "bi"},
		{"ブ", "bu"},
		{"ベ", "be"},
		{"ボ", "bo"},

		{"ヷ", "va"},
		{"ヸ", "vi"},
		{"ヹ", "ve"},
		{"ヺ", "vo"},

		{"パ", "pa"},
		{"ピ", "pi"},
		{"プ", "pu"},
		{"ペ", "pe"},
		{"ポ", "po"},

		// 撥音・拗音等その他文字種
		{"ン", "n"},
		{"ッ", "t"},
		{"ー", "-"},

		{"ャ", "y"},
		{"ュ", "y"},
		{"ョ", "y"},

		{"ァ", "a"},
		{"ィ", "i"},
		{"ゥ", "u"},
		{"ェ", "e"},
		{"ォ", "o"},
	}
	for _, r := range syllables {
		s = Syllable(strings.ReplaceAll(string(s), r.old, r.new))
	}
	return s
}
